package HW16;

import java.util.Scanner;

/*public class EX2*/
    /*public static void main(String[] args) {*/
       /* Scanner input = new Scanner(System.in);
        System.out.println("Введите текст:");
        String string = input.nextLine();
        String[] array = string.toLowerCase().split("а");

        while ( int x=0; = array.length - 1;x >= 0;){
            System.out.print(array.length);
        }
    }
}*/

    /*При помощи цикла while выполнить реализацию следующего алгоритма.
        Пользователь вводит строку с клавиатуры. Программа должна вывести на
        экран сколько символов "a", присутсвует в данной строке.*/